{
	"Locale": "ru",
	"MetaData": {
		"title": "goosen.pro Web Developer Portfolio",
		"description": "Projects and experience in web development: building modern applications using Next.js, Strapi, PostgreSQL, and other technologies."
	},
	"Header": {
		"nav": {
			"main": "Главная",
			"techstack": "Стек технологий",
			"projects": "Проекты",
			"experience": "Опыт",
			"contact": "Контакты"
		},
		"cv": {
			"btnText": "СКАЧАТЬ РЕЗЮМЕ",
			"href": "https://drive.google.com/file/d/1B-jDKElDsy7tDEl-sEOIG70IF5NqBrL6/view?usp=sharing"
		}
	},
	"SectionMain": {
		"language": "ru",
		"job": "Fullstack-разработчик",
		"name": "Борисенко Дмитрий",
		"contact": "НАПИСАТЬ EMAIL",
		"email": {
			"subject": "Вакансия: Позиция Frontend-разработчика",
			"body": "Уважаемый Дмитрий Борисенко,\n\nЯ ознакомился с вашим портфолио и впечатлен вашими навыками и опытом. Я бы хотел обсудить с вами потенциальную возможность работы.\n\nМожем ли мы запланировать звонок, чтобы поговорить о [кратко опишите позицию или проект]?\n\nС нетерпением жду вашего ответа.\n\nС уважением,\n[Ваше Имя]\n[Ваша Компания]"
		},
		"location": "Россия, Москва",
		"markedText": "Привет! Я Fullstack-разработчик из России.",
		"aboutFirst": "Люблю заниматься разработкой и создавать не просто красивые, но и удобные веб-интерфейсы. Постоянно учусь новому, следую за трендами в веб-разработке, чтобы проекты использовали современный стек технологий. Особенно интересуюсь оптимизацией производительности и улучшением пользовательского опыта. Стремлюсь к созданию масштабируемых и легко поддерживаемых приложений.",
		"aboutSecond": "В работе для меня важно, чтобы она была не только качественно выполненa, но и вызывала положительные эмоции у пользователей. Я открыт к новым проектам и интересным вызовам!",
		"subscribeTitle": "Подписаться на рассылку",
		"subscribePlaceholder": "Введите ваш email",
		"subscribeButton": "Подписаться"
	},
	"SectionTechStack": {
		"title": "Стек технологий",
		"frontend": "Frontend",
		"backend": "Backend",
		"other": "Другие инструменты"
	},
	"SectionProjects": {
		"title": "Проекты",
		"about": "О проекте",
		"moreButton": "Узнать больше",
		"projects": {
			"komponenta": {
				"name": "Komponenta",
				"company": "Компания специализируется на оказании профессиональной помощи в сфере банкротства физических лиц. Она предоставляет комплексные услуги для клиентов, столкнувшихся с финансовыми трудностями.",
				"description": "Этот проект представляет собой одностраничное приложение (SPA), разработанное с использованием чистого JavaScript (ES6+) без применения фреймворков, реализующее модульную структуру кода с использованием паттерна MVC для улучшения масштабируемости и поддерживаемости. Оптимизация производительности достигнута за счет применения lazy loading для изображений и асинхронной загрузки JavaScript модулей, а взаимодействие с API AmoCRM реализовано через нативный Fetch API с обработкой ошибок и повторными попытками при сбоях сети. Для обеспечения отзывчивого дизайна использованы CSS Grid и Flexbox, а процесс сборки настроен с использованием Webpack для минификации и бандлинга ресурсов, с последующим развертыванием через CI/CD пайплайн на выделенный Linux-сервер с Nginx. Особое внимание уделено безопасности: реализована защита от XSS-атак, настроены заголовки безопасности и внедрена система rate limiting на уровне сервера для предотвращения DDoS-атак. Интегрирован кастомный модуль для сбора метрик производительности и пользовательского поведения с отправкой данных в Google Analytics, что позволяет оценивать эффективность приложения и улучшать пользовательский опыт. Проект демонстрирует глубокое понимание vanilla JavaScript, асинхронного программирования, оптимизации производительности веб-приложений и настройки серверной инфраструктуры, обеспечивая плавный пользовательский опыт и эффективную обработку клиентских заявок по банкротству физических лиц."
			},
			"mba": {
				"name": "Moscow Business Academy",
				"company": "Moscow Business Academy - коммерческий институт онлайн бизнес-образования. Компания специализируется на предоставлении качественных образовательных программ в сфере бизнеса и управления через современную онлайн-платформу, делая бизнес-образование доступным и эффективным для профессионалов по всему миру.",
				"description": "Проект представляет собой полный редизайн и переработку веб-платформы Moscow Business Academy с использованием современного стека технологий. Разработка выполнена на базе Next.js, что обеспечивает высокую производительность и SEO-оптимизацию благодаря серверному рендерингу. Для стилизации использован SASS, позволяющий создавать масштабируемые и легко поддерживаемые стили. Бэкенд реализован на Strapi, предоставляя гибкое управление контентом и API. Взаимодействие между фронтендом и бэкендом осуществляется через GraphQL, что оптимизирует запросы данных и улучшает производительность приложения. Развертывание и управление контейнерами осуществляется с помощью Portainer, обеспечивая удобство в обслуживании и масштабировании проекта. Ключевые особенности включают интеграцию с AmoCRM для эффективного управления взаимоотношениями с клиентами, а также внедрение системы онлайн-оплаты непосредственно на сайте. Проект демонстрирует глубокое понимание современных веб-технологий, практик разработки и потребностей образовательных онлайн-платформ, обеспечивая пользователям удобный и функциональный интерфейс для доступа к образовательным ресурсам и управления обучением."
			},
			"digitalDyatel": {
				"name": "Digital Dyatel",
				"company": "Digital Dyatel специализируется на управлении репутацией в интернете через SEO. Компания предоставляет услуги по Online Reputation Management, включая формирование положительного имиджа и отражение информационных атак. Благодаря Digital Dyatel, клиенты увеличивают узнаваемость бренда и улучшают свои рыночные позиции",
				"description": "Проект Digital Dyatel находится на стадии активной разработки и представляет собой современную веб-платформу для управления репутацией и маркетинга в интернете. Разработка ведется с использованием Next.js, что обеспечивает высокую производительность и оптимизацию для поисковых систем благодаря серверному рендерингу. Бэкенд реализован на Strapi, предоставляя гибкое управление контентом и API. Для стилизации и компонентной базы используется библиотека shadcn/ui, что позволяет создавать современный и консистентный пользовательский интерфейс. Проект развернут на собственном хостинге (self-hosted), что дает полный контроль над инфраструктурой и данными. Одной из ключевых особенностей разработки является создание функционального блога, который станет важным инструментом для контент-маркетинга и SEO-оптимизации. Несмотря на то, что проект все еще находится в разработке, он уже демонстрирует потенциал для эффективного решения сложных задач в сфере управления онлайн-репутацией и маркетинга. По мере развития проекта планируется внедрение дополнительных функций для анализа и управления репутацией в реальном времени, что сделает платформу Digital Dyatel уникальным и мощным инструментом на рынке ORM-услуг."
			},
			"healthshop": {
				"name": "HealthShop",
				"company": "HealthShop - инновационный онлайн-магазин товаров для здоровья и wellness-продукции. Компания предлагает широкий ассортимент качественных товаров для здорового образа жизни, включая органические продукты, пищевые добавки, спортивное питание и натуральную косметику. HealthShop выделяется тщательным отбором продукции и сотрудничеством с проверенными производителями",
				"description": "Проект HealthShop представляет собой современную e-commerce платформу, разработанную с использованием передовых веб-технологий. Фронтенд реализован на React с использованием Next.js для обеспечения высокой производительности, SEO-оптимизации и улучшенного пользовательского опыта. Для управления состоянием приложения применяется Redux, а стилизация осуществляется с помощью Styled Components, что позволяет создавать гибкие и легко поддерживаемые стили. Бэкенд построен на Node.js с использованием Express.js, а для работы с базой данных выбрана MongoDB, обеспечивающая высокую производительность и масштабируемость. Платежная система интегрирована с использованием Stripe API, гарантируя безопасность транзакций. Особое внимание уделено разработке умной системы рекомендаций, которая анализирует поведение пользователей и предлагает персонализированные товары. Реализована функция сравнения продуктов, позволяющая клиентам легко сопоставлять характеристики различных товаров. Интегрирована система отзывов и рейтингов, помогающая пользователям принимать обоснованные решения о покупке. Проект также включает информационный раздел с экспертными статьями о здоровом образе жизни и правильном использовании продукции. Для улучшения пользовательского опыта внедрен чат-бот на базе машинного обучения, способный отвечать на часто задаваемые вопросы и помогать в выборе товаров. HealthShop демонстрирует высокий уровень технической реализации, сочетая современные технологии разработки с инновационными решениями в сфере e-commerce и здравоохранения."
			}
		}
	},
	"SectionExperience": {
		"title": "Опыт работы",
		"companies": {
			"mba": {
				"title": "2023-Now",
				"job": "Fullstack Developer",
				"company": "MBA",
				"city": "Москва",
				"companyUrl": "https://www.moscow.mba/",
				"description": "Разрабатывал и поддерживал веб-приложения для Moscow Business Academy и нескольких образовательных организаций с использованием Next.js на фронтенде, Strapi в связке с PostgreSQL на бэкенде. Взаимодействовал с Portainer для управления контейнерами, устранял баги и выполнял DevOps задачи, связанные с CI/CD и автоматизацией развертывания"
			},
			"dobrostock": {
				"title": "2023",
				"job": "Fullstack Developer",
				"company": "Dobrostok",
				"city": "Москва",
				"companyUrl": "https://dobrostock.ru/",
				"description": "Разработал админ-панель для авторов фотостока Dobrostok, используя T3 stack и Next.js, обеспечив удобный интерфейс для управления контентом. Реализовал систему авторизации с использованием NextAuth. Оптимизировал изображения на бэкенде, что повысило производительность сайта и ускорило время загрузки"
			},
			"inspro": {
				"title": "2020-2022",
				"job": "Fullstack Developer",
				"company": "Inspro",
				"city": "Москва",
				"companyUrl": "https://www.inspro.ru/",
				"description": "Работал в компании, предоставляющей бухгалтерские услуги, где занимался разработкой на бэкенде, включая работу с базами данных PostgreSQL. Управлял различными серверными процессами, такими как синхронизация данных между учетными системами и реализация системы отчетности для клиентов. Обеспечивал производительность и безопасность системы, поддерживая эффективную обработку бухгалтерских данных и отчетности"
			},
			"mbloq": {
				"title": "2019-2020",
				"job": "Frontend Developer",
				"company": "Mbloq",
				"city": "Москва",
				"companyUrl": "",
				"description": "Разработал интернет-магазин женской одежды Mbloq на Vanilla JS. Работал с CMS WordPress для управления товарами, заказами и пользователями. Оптимизировал сайт для поисковых систем (SEO), включая улучшение семантикии структуры URL, а также внедрил систему структурированных данных (Schema.org). Выполнял деплой веб-приложений на сервер, включая настройку окружения и автоматизацию сборки проекта"
			}
		}
	},
	"Footer": {
		"slogan": "Каждая строка кода - это шаг к совершенству. Готов принять ваш вызов и превратить его в успешный проект",
		"copyright": "Сайт разработан Борисенко Дмитрием",
		"description": "Посмотреть исходный код на GitHub"
	}
}
